In [ ]:
1) row labels / row names / dataframe index
2) column labels / column names
3) dataframe values

In [1]:
import pandas as pd

# 1st Approach: using a dictionary

The first postional argument has to be in the form of dictionary. 
In the dictionary, the keys will act as column labels for the dataframe, and the values in the dictionary will act as value for the dataframe. Make sure that the values in the dictionary are in the form of a list

In [2]:
pd.DataFrame({"Player":["Pant","Kohli","Rahul"],"Runs":[109,28,79]})

  Player  Runs
0   Pant   109
1  Kohli    28
2  Rahul    79

In [3]:
pd.DataFrame({"Player":["Pant","Kohli","Rahul"],"Runs":[109,28,79]},index=[1,100,200])

    Player  Runs
1     Pant   109
100  Kohli    28
200  Rahul    79

In [4]:
pd.DataFrame({"Player":["Pant","Kohli","Rahul"],"Runs":[109,28,79]},index=[1,"B",200])

    Player  Runs
1     Pant   109
B    Kohli    28
200  Rahul    79

We can store values of different data types. However, in one column I will have values of one type only. If it is not, then python will convert to one type only.

In [5]:
pd.DataFrame({"Player":["Pant","Kohli","Rahul"],"Runs":[109,90.8,79]},index=[1,"B",200])

    Player   Runs
1     Pant  109.0
B    Kohli   90.8
200  Rahul   79.0

# 2nd approach: using a csv (comma separated values) file

In [ ]:
1. someone will store the data in a csv file:
    a) the first line of the csv file is reserved for column labels
    b) from the second line onward, we will start writing the row labels and the dataframe values
2. we will take the data in that csv file, and convert it to dataframe

In [7]:
df=pd.read_csv("D:/Datasets/testBI_may.csv")

In [8]:
df

  Players  Runs  Avg
A   Kohli    20   51
B     Abd    80   52
C     MSD     0   48
D   Rohit   219   47

In [ ]:
1) row labels / row names / dataframe index
2) column labels / column names
3) dataframe values

In [9]:
df=pd.read_csv("D:/Datasets/testBI_may.csv")

In [10]:
df

  Players  Runs  Avg
0   Kohli    20   51
1     Abd    80   52
2     MSD     0   48
3   Rohit   219   47

In [13]:
df=pd.read_csv("D:/Datasets/testBI_may.csv")

In [14]:
df

  Players  Unnamed: 1  Avg
A   Kohli          20   51
B     Abd          80   52
C     MSD           0   48
D   Rohit         219   47

In [15]:
df=pd.read_csv("D:/Datasets/testBI_may.csv")

In [16]:
df

  Players  Runs  Unnamed: 2
A   Kohli    20          51
B     Abd    80          52
C     MSD     0          48
D   Rohit   219          47

In [17]:
df=pd.read_csv("D:/Datasets/testBI_may.csv")

In [18]:
df

  Players  Runs  Avg
A   Kohli    20   51
B     Abd    80   52
C     MSD     0   48
D   Rohit   219   47

# Subsetting in a dataframe

# Technique 1: using square brackets

In [ ]:
Limitations:
1) You cannnot subset rows and column together
2) you can only subset rows which are consecutive and that too using slicing

In [19]:
df

  Players  Runs  Avg
A   Kohli    20   51
B     Abd    80   52
C     MSD     0   48
D   Rohit   219   47

In [20]:
df["Runs"]

A     20
B     80
C      0
D    219
Name: Runs, dtype: int64

In [21]:
df

  Players  Runs  Avg
A   Kohli    20   51
B     Abd    80   52
C     MSD     0   48
D   Rohit   219   47

In [22]:
df["Players"]

A    Kohli
B      Abd
C      MSD
D    Rohit
Name: Players, dtype: object

In [23]:
df

  Players  Runs  Avg
A   Kohli    20   51
B     Abd    80   52
C     MSD     0   48
D   Rohit   219   47

In [24]:
df

  Players  Runs  Avg
A   Kohli    20   51
B     Abd    80   52
C     MSD     0   48
D   Rohit   219   47

In [26]:
df[["Players","Avg"]]

  Players  Avg
A   Kohli   51
B     Abd   52
C     MSD   48
D   Rohit   47

In [ ]:
Limitations:
1) You cannnot subset rows and column together
2) you can only subset rows which are consecutive and that too using slicing

In [27]:
df

  Players  Runs  Avg
A   Kohli    20   51
B     Abd    80   52
C     MSD     0   48
D   Rohit   219   47

In [28]:
df[ 0:2]

  Players  Runs  Avg
A   Kohli    20   51
B     Abd    80   52

In [29]:
df[1: ]

  Players  Runs  Avg
B     Abd    80   52
C     MSD     0   48
D   Rohit   219   47

In [30]:
df

  Players  Runs  Avg
A   Kohli    20   51
B     Abd    80   52
C     MSD     0   48
D   Rohit   219   47

In [31]:
df[1:2]

  Players  Runs  Avg
B     Abd    80   52

# Technique 2 and 3: loc and iloc

In [ ]:
syntax for loc technique:
    
dataframeReference.loc[row labels ,column labels ]

In [ ]:
syntax for iloc technique:
    
dataframeReference.iloc[row indexes ,column indexes ]

In [32]:
df

  Players  Runs  Avg
A   Kohli    20   51
B     Abd    80   52
C     MSD     0   48
D   Rohit   219   47

In [33]:
df.loc[ ["A","D"] ,["Players","Avg"] ]

  Players  Avg
A   Kohli   51
D   Rohit   47

In [34]:
df.iloc[[0,3] ,[0,2] ]

  Players  Avg
A   Kohli   51
D   Rohit   47

In [35]:
df

  Players  Runs  Avg
A   Kohli    20   51
B     Abd    80   52
C     MSD     0   48
D   Rohit   219   47

In [ ]:
syntax for loc technique:
    
dataframeReference.loc[row labels ,column labels ]

In [ ]:
syntax for iloc technique:
    
dataframeReference.iloc[row indexes ,column indexes ]

In [40]:
df.loc[ ["B","C"] ,"Runs" ]

B    80
C     0
Name: Runs, dtype: int64

In [41]:
df.iloc[[1,2] ,1 ]

B    80
C     0
Name: Runs, dtype: int64

# Subsetting with conditions

In [43]:
df=pd.read_csv("D:/Datasets/cars.csv")

In [44]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
1. subset the column of interest
2. convert the output to boolean based on a comparison operator
3. dataframereference[..code uptil step 2..]

In [47]:
df[df["country"]=="Russia"]

  Abbreviation  cars_per_cap country  drives_right
E           RU           200  Russia          True

In [ ]:
1. subset the column of interest
2. convert the output to boolean based on a comparison operator
3. dataframereference[..code uptil step 2..]

In [50]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [51]:
df[df["drives_right"]==False]

  Abbreviation  cars_per_cap    country  drives_right
B          AUS           731  Australia         False
D           IN            18      India         False

In [52]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
1. subset the column of interest
2. convert the output to boolean based on a comparison operator
3. dataframereference[..code uptil step 2..]

In [55]:
df[df["cars_per_cap"]>200]

  Abbreviation  cars_per_cap    country  drives_right
B          AUS           731  Australia         False
C          JAP           588      Japan          True

In [56]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
1. subset the column of interest
2. convert the output to boolean based on a comparison operator
3. dataframereference[..code uptil step 2..]

In [61]:
df[(df["drives_right"]==True) & (df["cars_per_cap"]>500)]

  Abbreviation  cars_per_cap country  drives_right
C          JAP           588   Japan          True

In [62]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
1. subset the column of interest
2. convert the output to boolean based on a comparison operator
3. dataframereference[..code uptil step 2..]

In [67]:
df[(df["Abbreviation"]=="MOR") & (df["cars_per_cap"]==500)]

Empty DataFrame
Columns: [Abbreviation, cars_per_cap, country, drives_right]
Index: []

In [68]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [69]:
df[(df["Abbreviation"]=="MOR") | (df["cars_per_cap"]==500)]

  Abbreviation  cars_per_cap  country  drives_right
F          MOR            70  Morocco          True